In [1]:
import pyspark
from pyspark.sql import SparkSession
# Spark init
spark = SparkSession.builder \
    .master("local") \
    .appName('jupyter-pyspark') \
    .getOrCreate()
sc = spark.sparkContext
sc.setLogLevel("ERROR")

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/usr/local/spark-3.1.2-bin-hadoop3.2/jars/spark-unsafe_2.12-3.1.2.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
24/01/31 21:48:39 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

5.	Load a Spark dataframe of USA country suppliers and their products for products that are not discontinued. Include supplier company and contact names, country and phone. From products include product name, discontinued, unit price and units in stock.

In [26]:
df = spark.read.csv("/home/jovyan/datasets/customers/customers.csv", header=True, inferSchema=True)

In [27]:
df.toPandas().head(5)

,First,Last,Email,Gender,Last IP Address,City,State,Total Orders,Total Purchased,Months Customer
0,Al,Fresco,afresco@dayrep.com,M,74.111.18.161,Syracuse,NY,1,45,1
1,Abby,Kuss,akuss@rhyta.com,F,23.80.125.101,Phoenix,AZ,1,25,2
2,Arial,Photo,aphoto@dayrep.com,F,24.0.14.56,Newark,NJ,1,680,1
3,Bette,Alott,balott@rhyta.com,F,56.216.127.219,Raleigh,NC,6,560,18
4,Barb,Barion,bbarion@superrito.com,F,38.68.15.223,Dallas,TX,4,1590,1

In [28]:
df.describe()

DataFrame[summary: string, First: string, Last: string, Email: string, Gender: string, Last IP Address: string, City: string, State: string, Total Orders: string, Total Purchased: string, Months Customer: string]

In [12]:
df.createOrReplaceTempView("customers")

In [25]:
query = """

with source as (
    select State, cast("Total Orders" as decimal) as total_orders, Gender 
    from customers
)
select State, sum(total_orders) as total_orders
    from source 
    where gender = 'F'
    group by State
"""

spark.sql(query).show()

+-----+------------+
|State|total_orders|
+-----+------------+
|   AZ|        null|
|   NJ|        null|
|   VA|        null|
|   CA|        null|
|   NC|        null|
|   ME|        null|
|   OH|        null|
|   NY|        null|
|   TX|        null|
|   FL|        null|
+-----+------------+